import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})

export class Config {
  
  i18n:object = {
    cancel:	'Відмінити',
    clear:	'Очистити',
    done:	'Ok',
    previousMonth:	'‹',
    nextMonth:	'›',
    months: [
      'Січень',
      'Лютий',
      'Березень',
      'Квітень',
      'Травень',
      'Червень',
      'Липень',
      'Серпень',
      'Вересень',
      'Жовтень',
      'Листопад',
      'Грудень'
    ],
    monthsShort: [
      'Січ',
      'Лют',
      'Бер',
      'Кві',
      'Тра',
      'Чер',
      'Лип',
      'Сер',
      'Вер',
      'Жов',
      'Лис',
      'Гру'
    ],
    weekdays: [
      'Неділя',
      'Понеділок',
      'Вівторок',
      'Середа',
      'Четвер',
      'П\'ятниця',
      'Субота'
    ],
    weekdaysShort: [
      'Нед',
      'Пон',
      'Вів',
      'Сер',
      'Чет',
      'Пт',
      'Суб'
    ],
    weekdaysAbbrev:	['Нд','Пн','Вт','Ср','Чт','Пт','Сб']
  }
} 

